# StairsRuntypeUndersideSurfaceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRuntypeUndersideSurfaceType Property
ParameterTypeId Class See Also
---
"Underside Surface": Underside Surface
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRuntypeUndersideSurfaceType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRuntypeUndersideSurfaceType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRuntypeUndersideSurfaceType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace